arei-app-api/app/controllers/api/v1/users_controller.rb

def set_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE (1) LIMIT $1  [["LIMIT", 1]]